jayis1/daily-ideas/systems/soc-devices/hall-puck/firmware/esp32-c3/sdkconfig.defaults
# Hall Puck — ESP32-C3 companion sdkconfig defaults

CONFIG_IDF_TARGET="esp32c3"

CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_PARTITION_TABLE_SINGLE_APP=y

CONFIG_FREERTOS_HZ=1000

# BLE (NimBLE)
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_ATT_MTU=256

# Wi-Fi (softAP)
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y

# HTTP server
CONFIG_ESP_HTTP_SERVER_ENABLED=y

# NVS
CONFIG_NVS_ENCRYPTION=n

CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

CONFIG_LOG_DEFAULT_LEVEL_INFO=y